abandon
abbey
abbreviation
abide
ability
able
abnormal
aboard
abolish
abolition
aboriginal
aborigine
abortion
about
above
abroad
abrupt
absence
absent
absolute
absorb
absorbing
abstract
abstraction
absurd
abundance
academic
acceleration
accept
acceptable
acceptance
accessible
accessory
accident
accidental
acclaim
accommodation
accompany
accomplish
accomplished
accomplishment
accord
accordingly
account
account
accountable
accountant
accounting
accumulate
accumulation
accuracy
accurate
accusation
accuse
accustom
ace
ache
achieve
acoustic
acquaintance
acquire
acquisition
acre
acreage
across
act
action
active
activity
actor
actress
actual
acute
ad
adapt
adaptation
add
addict
addiction
addition
additional
address
adequately
adjoin
adjust
administrative
administrator
admirable
admiral
admiration
admire
admission
admit
adolescence
adolescent
adopt
adult
advance
advanced
advancement
advantage
adventure
adverse
advert
advertise
advertising
advice
advise
adviser
advisor
advisory
advocate
aerospace
aesthetic
affair
affect
affection
affiliated
afford
afraid
after
aftermath
afternoon
afterward
again
against
age
agency
agenda
agent
aggregate
aggression
aggressive
aging
ago
agony
agree
agriculture
ahead
aid
aide
AIDS
aim
air
air
aircraft
airforce
airline
airmail
airplane
airport
airway
aisle
akin
alarm
alarming
alas
albeit
album
alcohol
alcoholic
alert
algebra
alien
alienate
alienation
alike
alive
all
allegation
allege
allergy
alley
alliance
allied
allocate
allocation
interj
pron
tight
allot
allow
almost
alone
along
alongside
aloud
alphabet
already
also
alteration
alternate
alternative
alternatively
although
altitude
altogether
aluminum
always
amateur
amaze
amazing
ambassador
ambiguity
ambiguous
ambition
ambitious
ambulance
ambush
amend
amenna
amid
ammunition
amnesty
among
amount
amuse
analects
analogy
analysis
analyst
analyze
ancestor
ancestral
anchor
ancient
anecdote
angel
anger
angle
angler
angry
angular
animal
ankle
anniversary
announce
annual
anonymous
another
answer
ant
anthem
antibiotic
antibody
anticipation
antique
anxiety
anxious
any
anyhow
anymore
anyway
apart
apartment
ape
apologize
apology
appal
appall
appalling
apparent
appeal
appealing
appear
appearance
appetite
appetizer
applaud
applause
appliance
pron
pron
applicable
applicant
application
apply
appoint
appointment
appraisal
appreciate
appreciation
apprehension
apprentice
approach
appropriate
approval
approve
April
apron
apt
aptitude
aquarium
arch
archaeology
architect
architecture
archive
area
arena
argue
arise
arithmetic
arm
armchair
armed
army
around
arouse
arrange
array
arrest
arrival
arrive
arrogant
arrow
art
article
articulate
artificial
artillery
artist
artistic
as
ascertain
ascribe
ash
ashamed
aside
ask
asleep
aspect
aspiration
aspirin
aspiring
ass
assassinate
assault
assemble
assembly
assertion
assertive
assertively
asset
assign
assist
assistance
assistant
associate
associate
association
assume
assurance
assure
astonish
astronaut
astronomy
asylum
athlete
athletic
atmosphere
attach
attack
amobiography
attainment
attempt
attend
attendant
attention
attic
attitude
attract
attraction
attractive
auction
audience
audio
audio
auditorium
August
aunt
Australia
author
authority
auto
automatic
automatically
automobile
autonomy
autumn
availability
avenge
avenue
average
aviation
avoid
await
awake
awaken
awaking
award
away
awful
awkward
awkwardly
ax
baby
baby
bachelor
back
background
backward
bacon
bacteria
bad
badminton
bag
baggage
bail
bait
bake
bakery
balance
balcony
bald
ball
ballad
ballet
balloon
ballot
ballroom
bamboo
ban
banana
band
bandage
bank
bank
banker
bankrupt
banquet
baptism
bar
barbarian
barbecue
barber
barbershop
bare
barely
prop
sitter
visual
bam
bargain
bargaining
bark
barkeeper
barrel
barrier
bartender
base
baseball
based
basement
basic
basin
basket
basketball
bass
bastard
bat
bath
bathe
bathroom
bathtub
batter
battery
battle
battlefield
bay
BBC
beach
beam
bean
bear
bear
beard
beast
beat
beautiful
beautify
beauty
because
beckon
become
bed
bedroom
bee
beef
beer
before
beg
beggar
begin
beginner
behalf
behave
behavior
behind
behold
Beijing
being
belief
believe
bell
belly
belong
belongings
beloved
below
belt
bench
bend
beneath
beneficial
benefit
berry
beside
besides
besiege
best
bestseller
bet
better
between
beverage
beware
bewilder
beyond
bias
Biblical
prop
bicycle
bid
big
bike
bikini
bill
billion
billionaire
bind
bingo
binomial
biochemistry
biography
biological
biology
bird
birth
biscuit
bishop
bite
bitter
bitterly
bitterness
biweekly
bizarre
black
blackboard
blame
blameworthy
bland
blank
blanket
blast
blaze
bleak
bleed
blend
bless
blessing
blind
blink
bloc
block
blonde
blood
bloody
bloom
blossom
blow
blue
blueprint
blues
bluff
blunder
blur
blush
board
board
boast
boat
bodily
body
bodyguard
boil
bold
boldly
bolt
bomb
bond
bone
bonus
book
book
bookcase
bookstore
boom
boost
boot
booth
border
bore
bored
boring
born
borrow
boss
botany
both
bother
bottle
boulevard
pron
bounce
bound
bow
bow
bowl
bowling
box
boxing
boy
boycott
brace
brain
brake
branch
brand
brave
bravery
breach
bread
break
break
breakdown
breakfast
breakthrough
breast
breath
breathe
breathtaking
breed
breeder
breeze
brew
brick
bride
bridegroom
bridge
brief
briefcase
briefmg
brigade
bright
brighten
brilliant
bring
brisk
Briton
broad
broadcast
broaden
brochure
broker
brood
brook
brother
brown
browse
brush
brutal
brutality
bubble
buck
bucket
bud
Buddha
Buddhism
budget
buffalo
buffet
buffet
bug
build
building
bulb
bulk
bull
bullet
bulletin
bully
bump
bun
bunch
bundle
bunk
bunker
burden
bureau
bureaucracy
burglar
burn
burst
dollar
up
bury
bus
bush
business
businesslike
busy
butcher
butter
butterfly
button
buy
cab
cabbage
cabin
cabinet
cable
cafe
cafeteria
cage
cake
calculate
calculation
calculator
calendar
calf
call
calm
calorie
camel
camera
camp
campaign
campus
can
canal
cancel
cancer
candidate
candle
candy
cane
canvas
canyon
cap
capable
capacity
cape
capital
capital
capitalist
capitol
captain
caption
captive
captivity
capture
carbon
card
cardinal
care
career
carefree
careful
careless
caress
cargo
carnival
carp
carpenter
carpet
carriage
carrier
carrot
carry
cart
cartoon
carve
case
case
cash
cashier
casino
cassette
cast
caste
castle
casual
casually
ism
casualty
catalogue
catastrophe
catch
catcher
cater
caterpillar
cattle
causal
cause
caution
cautious
cautiously
cavalry
cave
CD
cease
ceasefire
ceiling
celebrate
celebration
celebrity
cell
cellar
cemetery
census
cent
center
centigrade
central
century
ceramic
cereal
ceremonious
ceremony
certain
certificate
chain
chair
chairwoman
chalk
challenge
challenging
chamber
champagne
champion
championship
chance
Chancellor
changeable
channel
chaos
chapter
character
characteristic
charge
charitable
charity
charm
charming
chart
chase
chat
chatterbox
cheap
cheat
check
check
check
checkbook
checkup
cheek
cheer
cheerful
cheerleader
cheers
cheese
chef
chemical
chemist
chemistry
cherish
cherry
chess
chessboard
chest
chew
chick
chicken
chief
compact
disc
in
interj
nJv
out
child
childbirth
childcare
childhood
childish
childlike
children
chill
chilly
chimney
chimpanzee
chin
china
chip
chlorine
chocolate
choice
choir
choke
cholesterol
choose
chop
chopstick
chorus
Christianity
chronic
chunk
church
churchyard
cigar
cigarette
circle
circulate
circulation
circumstance
circus
citizen
citizenship
city
civics
civilian
civilization
civilize
claim
clarify
clash
class
classic
classical
classification
classmate
classroom
clause
claw
clay
clean
cleaner
cleaning
cleanse
clear
clergyman
clerk
clever
click
client
cliff
climate
climax
climb
clinic
clip
clock
clockwise
clockwork
close
close
closet
closure
cloth
clothe
clothes
clothing
cloud
cloudy
clown
club
clue
clumsy
cluster
clutch
pl
blind
coach
coal
coalition
coarse
coast
coastguard
coastline
coat
cocaine
cock
cockpit
cockroach
cocktail
coconut
code
coed
coeducation
coexist
coffee
coffin
coin
coincidence
coke
cola
collaborate
collapse
collar
colleague
collect
collection
collector
college
collision
colonial
colony
color
color
colorful
column
columnist
comb
combination
combine
come
comedian
comedy
comet
comfortably
comforting
comic
coming
command
commander
commemorate
commend
comment
commentary
commentator
commerce
commercial
commission
commit
commitment
committee
commodity
common
commonplace
communal
communicate
communication
communicative
communist
community
commute
commuter
compact
companion
companionship
company
comparative
comparatively
compare
comparison
compartment
compass
compassionate
compatible
compatibly
compensate
compensation
compete
competence
competition
competitive
competitor
compile
complain
complaint
complement
complete
complex
complexion
complexity
complicate
complicated
complication
compliment
comply
component
compose
composer
composite
composition
comprehend
comprehensible
comprehension
comprehensive
compress
compromise
compulsively
compute
computer
computerize
comrade
conceal
concede
conceited
conceitedly
conceive
concentrate
concentration
concern
concert
concession
concise
conclude
conclusion
concrete
condense
condition
condom
conductor
confederation
confer
conference
confess
confession
confide
confidence
confident
confidential
confidently
confine
confirm
conflict
conform
conformity
confront
confrontation
Confucius
confuse
confused
confusion
congratulate
congratulation
congress
congressional
conjunction
connect
connection
conquer
conquest
conscientious
conscious
consciously
consciousness
consecutive
consensus
consent
consequence
comer
consequent
conservation
conservative
consider
considerable
considerate
consideration
consist
consistent
consolation
console
consolidate
conspiracy
constable
constant
constitute
constitution
constitutional
constraint
construct
construction
constructive
consult
consultant
consultation
consume
consumer
consumption
contact
contagious
contain
container
contaminate
contemplate
contempt
contemptible
contend
content
content
contented
context
continent
continental
contingent
continual
continuation
continue
continuous
contract
contractor
contradict
contradiction
contrary
contrast
contribute
contribution
control
controller
controversial
convene
convenience
convenient
convention
conventional
conversation
converse
convert
convertible
convey
convict
convince
convincing
convoy
cook
cooker
cookie
cooky
cool
cooperate
cooperation
cooperative
coordination
cop
cope
copilot
copy
copyright
cord
corn
corporation
correct
correlation
correspond
correspondent
corrupt
corruption
cosmetic
cosmic
cosmopolitan
cosmos
cost
costly
costume
cosy
cottage
cotton
couch
cough
council
councilman
counsel
counseling
counsellor
count
countable
countenance
counter
counter
counteract
counterattack
counterpart
countless
country
countryside
county
couple
coupon
courage
courageous
course
court
courteous
courtesy
courtyard
cousin
cover
coverage
cow
coward
cowardice
cowboy
coworker
cozy
crab
crack
crackdown
cradle
craft
cram
crane
crash
crawl
crayon
crazy
cream
create
creation
creative
creativity
creator
creature
credibility
credible
credit
creditable
creed
creep
crew
cricket
crime
criminal
cripple
crisis
critic
critical
criticism
criticize
crocodile
crop
cross
crossing
crossroad
crouch
crow
crowd
crowded
crown
crude
cruel
cruise
crumble
crush
cry
crystal
cub
cube
cubic
cucumber
cue
culminate
cult
cultivate
cultural
culture
cumulative
cunning
cup
cupboard
curb
cure
curfew
curiosity
curious
currency
current
curriculum
curry
curtain
curve
cushion
custody
custom
customary
customer
cut
cute
cycle
cylinder
dad
daddy
daily
dairy
dam
damage
damages
dame
damp
dance
dancer
danger
dangerous
dare
daresay
dark
darken
darkroom
darling
dart
dash
data
date
date
daughter
dawn
day
daybreak
daydream
daylight
dazzle
dead
deadline
deaf
deafen
deal
dean
dear
dearly
debate
debt
debut
nJv
decease
deceive
December
decency
decent
deception
deceptive
decide
decision
decisive
deck
declaration
declare
decline
decorate
decoration
decrease
decree
dedicate
deduction
deed
deem
deep
deepen
deer
defeat
defect
defend
defense
defensive
deficiency
deficit
define
definite
defy
degree
delay
delegate
delegation
deliberately
deliberation
delicacy
delicate
delicious
delight
delightful
delinquent
deliver
delivery
demand
demanding
demo
democracy
democrat
democratic
demon
demonstrate
demonstration
demonstration
denial
denomination
denote
denounce
dense
dental
dentist
deny
depart
department
departure
depend
dependent
depict
deplete
deploy
deport
deposit
depreciate
depress
depression
deprive
depth
descendant
descent
describe
description
desert
desert
deserve
design
designate
designer
desire
desk
despairing
desperate
despise
despite
dessert
destination
destroy
destruction
destructive
detach
detail
detailed
detain
detect
deter
detergent
deteriorate
determination
determine
devalue
devastating
develop
deviation
device
devil
devise
devote
devoted
devotion
diabetes
diagnose
diagnosis
diagram
dial
dialect
dialogue
diamond
diaper
diary
dictate
dictation
dictator
dictionary
die
diehard
diet
differ
difference
different
differential
differentiate
difficult
difficulty
diffusion
dig
digest
digestion
digital
dignify
dignitary
dignity
dilemma
diligence
diligent
dilute
dim
dime
dimension
diminish
dine
dinner
dinosaur
dip
diploma
diplomacy
diplomat
direct
direction
director
directory
dirt
dirty
disability
disable
disadvantage
disagree
disappear
ad
disappoint
disapproval
disapprove
disaster
disastrous
disbelieve
disc
discard
disciple
disciplinary
discipline
disclose
disclosure
disco
discomfort
disconnect
discontent
discount
discourage
discouraging
discover
discovery
discreet
discrepancy
discretion
discriminate
discrimination
discuss
discussion
disease
disguise
disgust
disgusting
dish
dishonest
dishwasher
disinterested
disk
dislike
dismantle
dismay
dismiss
disorder
disorganized
dispatch
dispel
dispensable
disperse
displace
displacement
display
displease
disposable
disposal
dispose
disposition
dispute
disqualify
disregard
disrupt
dissatisfaction
dissatisfy
dissident
dissuade
distance
distant
distinct
distinction
distinctively
distinguish
distinguished
distort
distract
distress
distribute
distribution
district
distrust
disturb
disturbing
ditch
dive
diverse
diversify
diversion
diversity
divide
dividend
divine
division
divorce
divorcee
dizzy
dock
doctor
document
documentary
dodge
dog
dogmatic
dole
doll
dollar
dolphin
domain
domestic
dominant
dominate
donate
donation
done
donkey
donor
doom
door
dorm
dormitory
dosage
dose
dot
double
doubt
doubtful
doubtless
dough
doughnut
dove
down
downstairs
downtown
downwards
doze
dozen
draft
draft
drag
dragon
dragonfly
drain
drainage
drama
dramatic
drape
drastic
draught
draw
drawback
drawer
drawing
dread
dreadful
dream
dress
drift
drill
drink
drive
driveway
drop
dropout
drought
drown
drowsy
drug
drugstore
drum
drunk
drunkard
dry
dryer
dual
dubious
duck
due
duke
dull
dumb
dump
durable
duration
during
dust
dutiful
duty
dwarf
dwell
dweller
dye
dynamic
dynamite
dynasty
each
eager
eagerly
eagle
ear
early
earn
earnest
earnings
earplug
earth
earthquake
earthworm
ease
east
Easter
eastwards
easy
eat
eccentric
echo
eclipse
ecology
economic
economical
economically
economics
economist
economy
edge
edible
edit
edition
editorial
educate
educated
education
educational
educator
eel
effect
effective
effectively
efficiency
efficient
effort
egg
ego
eight
eighteen
eighty
either
either
elaborate
elastic
elbow
elder
elderly
elect
election
elective
electric
electrician
electricity
electronic
electronics
elegant
element
elemental
elementary
elephant
elevate
elevator
eleven
eligible
eliminate
elite
eloquent
else
elsewhere
pron
pron
embargo
embark
embarrass
embassy
embody
embryo
emerge
emergency
emigrant
emission
emotion
emotional
emperor
emphasis
emphasize
empire
empirical
employ
employee
employer
empty
enable
enchant
enclose
encounter
encourage
encouraging
encyclopedia
end
endanger
endless
endorse
endowment
endurance
endure
enemy
energetic
energy
enforce
engagement
engine
engineer
engineering
enhance
enjoy
enjoyable
enlarge
enlighten
enlist
enormous
enough
enrich
enroll
ensue
ensure
entail
enter
entertain
enthusiasm
enthusiastic
entire
entrance
entry
envelope
envious
environment
environmental
envisage
envy
enzyme
epic
epigram
equal
equality
equip
equivalent
era
erase
eraser
erode
erosion
err
errand
error
escalator
escape
escort
essay
essence
mail
essential
essentially
establish
esteem
estimate
etemity
ethic
ethics
ethnic
etiquette
evaluate
evaluation
evaporate
eve
even
even
evening
event
eventual
ever
evergreen
every
evidence
evident
evil
evoke
evolution
evolve
exact
exaggerate
exaggeration
exam
examination
examine
examinee
examiner
example
exceedingly
excel
excellence
excellent
except
exception
exceptional
exchange
excite
exclaim
exclusively
excuse
executive
exempt
exercise
exhaust
exhaust
exhibit
exhibition
exile
exist
existence
exit
exotic
expand
expansion
expect
expectation
expedition
expel
expend
expensive
experience
experiment
experimental
experimentation
expert
expertise
expire
explain
explanation
explicit
explode
exploration
explore
explosion
explosive
export
expose
exposure
express
expression
extend
extension
extensive
exterior
extinct
extra
extract
extracurricular
extraordinary
extravagance
extreme
eye
eyesight
eyewitness
fable
face
facial
facility
fact
factor
factory
faculty
fade
fail
failure
faint
fair
fair
fairy
faith
faithful
fake
fall
fall
fame
familiar
family
famous
fan
fancy
fantastic
fantasy
far
faraway
fare
farewell
farm
farmer
farther
fashion
fast
fasten
fat
fatal
fate
father
fault
favor
favorable
favorite
fax
fear
feather
feature
February
fee
feed
feel
feet
fellow
female
fence
ferry
fertile
fertilizer
festival
fever
few
fiction
field
fierce
fifteen
fifth
fifty
fight
fighter
figuron
fil
fill
film
pl
pron
fiea
final
finance
financial
find
fine
fine
finger
finish
fire
fire
firm
first
fish
fisherman
fist
fit
fiu
five
fix
flag
flame
flash
flat
flatter
flavor
flee
flesh
flexible
float
flock
flood
floor
flour
flow
flower
fluent
fly
fly
foam
focus
fog
foggy
fold
folk
follow
follower
following
fond
food
fool
fool
foolish
foot
forbid
force
forecast
forehead
foreign
foreigner
forest
forever
forge
forget
forgetful
forgive
fork
form
formal
formation
former
formula
fort
forth
fortunate
fortune
forty
forward
forward
found
foundation
founder
fountain
four
fourteen
fox
fragment
fragrance
frame
fught
frank
free
freedom
freeway
freeze
freezer
frequency
frequent
fresh
freshman
Friday
friend
friendly
friendship
frighten
frog
from
front
frost
frown
fruit
frustrate
fry
fuel
fulfill
full
fun
function
functional
fund
fundamental
funeral
funny
fur
furious
furnish
furniture
further
furthermore
future
gaiety
gain
galaxy
hostess
hostile
hostility
hot
hotel
house
household
housekeeper
housewife
housework
housing
how
however
howl
hug
huge
human
humanity
humble
humbly
humid
humidity
humiliate
humiliation
humor
humorous
humorously
hundred
hunger
hungry
hunt
hunter
hurl
hurrah
hurricane
hurry
hurt
husband
hygiene
hymn
hyphen
hypocrisy
hypocrite
hypothesis
hysterical
interj
ad
gallery
gallon
gamble
game
gang
gap
garage
garbage
garden
gardener
garlic
gas
gasoline
gasp
gate
gather
gauge
gaze
gear
gear
Gemini
gender
gene
general
generalize
generate
generation
generator
generosity
generous
generously
genetics
genius
gentle
gentleman
genuine
geographical
geography
geometry
germ
gesture
get
ghetto
ghost
giant
gift
gifted
gigantic
gin
ginger
giraffe
girl
give
glad
glamour
glance
glare
glass
glasses
glassware
gleam
glide
glimpse
glitter
global
globe
gloomy
glorious
glory
glove
glow
glue
go
goal
goalkeeper
goat
god
goddess
gold
golden
goldfish
golf
good
goodbye
goodness
goods
goose
gorgeous
gospel
gossip
interj
govern
government
governor
gown
grab
grace
graceful
gracious
grade
gradual
graduate
graduation
grain
gram
grammar
grammatical
grand
grandchild
granddaughter
grandfather
grandma
grandmother
grandpa
grandson
grape
grapefruit
grasp
grass
grasshopper
grate
grateful
gratitude
grave
grave
gravestone
graveyard
gravity
gray
grease
greasy
great
greatness
greed
greedy
green
greenhouse
greet
greeting
grief
grieve
grill
grim
grin
grind
groan
grocery
groom
ground
group
grove
grow
growth
grumble
guarantee
guard
guardian
guess
guest
guidance
guideline
guilt
guilty
guitar
gulf
gum
gun
guy
gym
gymnasium
gypsy
habit
habitual
hail
hair
haircut
hairdo
hairdresser
hairstyle
half
halftvay
hall
ad
ad
hallway
halt
halt
ham
hamburger
hand
handbook
handful
handicap
handkerchief
handle
handle
handsome
handwriting
handy
hang
hanger
happen
happening
happily
happiness
happy
harassment
harbor
hard
harden
hardly
hardware
hardy
hare
harm
harmful
harmony
harness
harsh
harshly
harvest
hasten
hastily
hasty
hat
hatch
hate
hatred
haul
hawk
hay
head
head
headache
heading
headline
headquarters
heal
health
healthy
heap
hear
hearsay
heart
heat
heater
heaven
heavier
heavy
heavyweight
hedge
heel
height
heighten
heir
heiress
helicopter
helmet
help
helpful
herald
herd
here
heroin
heroine
hesitantly
heterosexual
hierarchy
hijack
hike
hinder
hint
hip
hire
on
historian
historic
historical
history
hit
hobby
hockey
hold
hole
holiday
Hollywood
holy
hom
home
homeland
homeless
homely
homesick
hometown
homework
homosexual
honest
honesty
honey
honeymoon
honor
honorable
hook
hop
hope
hopeful
horizon
hormone
horri
horrible
horrifying
horror
horse
hose
hospitable
hospital
host
hostage
hostel
hostess
hostile
hostility
hot
hotel
house
household
housekeeper
housewife
housework
housing
how
however
howl
hug
huge
human
humanity
humble
humbly
humid
humidity
humiliate
humiliation
humor
humorous
humorously
hundred
hunger
hungry
hunt
hunter
hurl
hurrah
hurricane
hurry
hurt
husband
hygiene
hymn
hyphen
hypocrisy
hypocrite
hypothesis
hysterical
interj
ice
iceberg
ID
idea
ideal
identical
identification
identify
identity
ideological
ideology
idiom
idiot
idle
idol
if
ignorance
ignorant
ignore
ill
illegal
illness
illogical
illuminate
illustrate
illustration
image
imaginary
imagination
imaginative
imagine
imitate
imitation
immediate
immense
immigrant
immigrate
immigration
imminent
immoral
immune
impact
impair
impartial
impatient
imperial
impersonal
implement
implicit
imply
impolite
import
importance
important
imposing
impractical
impress
impression
impressive
imprison
improve
inability
inappropriate
incentive
inch
incident
incidentally
inclination
include
including
income
incomplete
inconvenient
increase
incredible
incur
indebted
indecision
indeed
independence
independent
independently
indicate
indicator
indifference
indifferent
indigestion
indignant
indignation
indirect
indistinct
individual
indoor
indoors
indulge
industrial
industrialize
industrious
industry
ineffective
inefficient
inevitable
inexpensive
infant
infantry
infer
inference
inferior
infinite
inflation
inflict
influence
influential
influenza
inform
informal
information
informative
ingenuity
ingredient
inhabitant
inherit
initial
initial
initially
initiate
inject
injure
injury
injustice
ink
inn
inner
innocence
innocent
innovation
input
inquisitive
insane
insect
insecure
insert
inside
insist
inspect
inspection
inspiration
inspire
inspiring
instability
installation
instance
instant
instantly
instead
instinct
institutional
instruct
instruction
instructor
instrument
insult
insulting
insurance
intact
integral
integrity
intellect
intelligence
intelligent
intelligible
intend
intense
intensify
intensity
intensive
intent
intention
interact
interaction
intercept
interchangeable
intercourse
interest
interesting
interfere
interference
interior
intermediate
internal
international
Internet
interpret
interpretation
interpreter
interrupt
interruption
intersection
interview
intimate
intimidate
intonation
intricate
intrigue
intriguing
introduce
introduction
intuition
invade
invasion
invent
invention
inventor
invest
investigate
investigation
investigator
investor
invisible
invitation
invite
inviting
invoke
involve
inward
iron
ironic
irony
irregular
irrelevant
irresponsible
irritable
irritate
island
isolate
isolated
isolation
Italian
itch
item
ivory
jacket
jail
jam
January
Japanese
jar
jar
jasmine
jaw
jaywalk
jazz
jealous
jeans
jeep
jelly
jerk
jet
jewel
jewelry
job
jog
jog
join
joke
how
journal
journalism
journalist
journey
joy
joyful
joyous
judge
judicial
juice
July
jump
junction
June
jungle
junior
junk
just
just
justice
justification
justly
juvenile
kangaroo
keen
keenly
keep
ketchup
kettle
key
key
keyboard
kick
kid
kidnap
kidney
kill
killer
kind
kind
kindergarten
kindly
kindness
king
king
kingdom
kiss
kit
kitchen
kite
kitten
knee
kneel
knife
knight
knit
knob
knock
knot
know
know
knowledge
knowledgeable
lab
lab
label
labor
laboratory
lace
lack
lad
ladder
lady
lake
lama
lamb
lament
lamp
land
land
landing
landlady
landlord
landmark
landmine
landslide
lane
size
flatter
language
lantern
lap
large
largely
laser
last
last
late
lately
latest
latitude
latter
laugh
laughter
launch
laundry
law
lawful
lawmaker
lawn
lawnmower
lawsuit
lawyer
lay
layman
lazy
lead
leader
leadership
leaf
leak
leakage
lean
leap
learn
learned
lease
leather
leave
lecture
lecturer
leg
legacy
legal
legally
legend
leisure
leisurely
lemon
lemonade
lend
length
lengthen
lengthy
lens
lesbian
less
lesser
lesson
let
letter
level
liability
liar
liberal
liberate
liberation
liberty
librarian
library
license
lick
lid
lie
lieutenant
life
lifeboat
lifeguard
lifelong
lifetime
lift
light
lighten
lightning
lightweight
like
like
likelihood
pron
likely
likewise
liking
lily
limb
limit
limitation
limited
limp
line
linen
linger
lingering
linguist
linguistics
link
lion
lip
lipstick
liquid
liquidation
liquor
list
listen
listener
literacy
literary
literate
literature
litter
little
live
live
livelihood
lively
liver
livestock
living
lizard
load
loaf
loan
lobby
lobster
local
locate
location
lock
locomotive
loft
log
logic
logical
logo
logotype
lonely
lonesome
long
longevity
look
loom
loop
loose
loosely
loosen
lord
lorry
lose
loser
loss
lot
lotion
lottery
lotus
loud
loudspeaker
lounge
lousy
lovable
love
lovely
lover
loving
low
lower
loyal
loyalty
lubricant
luck
lucky
lucrative
luggage
luminous
lunar
lunch
luncheon
lung
luxury
lyric
machine
machinegun
machinery
mad
madam
magazine
magic
magical
magician
magnet
magnetic
magnificent
magnify
maid
maiden
mail
main
mainland
mainstream
maintain
majestic
majesty
major
majority
make
makeup
malaria
male
malicious
mall
man
manage
manageable
manager
mandarin
manhood
manifestation
manifesto
manipulate
mankind
manner
manners
manpower
mansion
manufacture
manufacturer
manuscript
many
map
marathon
marble
March
march
mare
margin
marginal
mark
market
marriage
married
marry
Mars
marshal
martial
marvel
marvelous
masculine
mask
mass
massacre
massage
master
master
masterpiece
mastery
mat
match
mate
material
mathematical
pron
man
math
mathematics
matter
matter
mature
maturity
maximum
May
maybe
mayor
meadow
meal
mean
mean
meaning
meaningful
meaningless
means
meanwhile
measles
measure
meat
mechanical
mechanics
medal
media
medical
medication
medicine
medieval
meditation
medium
meek
meet
meeting
melancholy
mellow
melody
melon
melt
member
membership
memo
memorable
memorial
memorize
men
menace
mental
mentality
mentally
mention
mentor
menu
merchant
mercy
mere
merit
merry
mess
message
messenger
metal
metaphor
metaphysical
meter
method
microphone
microwave
middle
midnight
mighty
migration
mild
mileage
militant
military
milk
mill
milligram
million
millionaire
mind
mine
miner
mingle
minimal
minimum
minister
ministry
minor
minority
minus
minute
miracle
miraculously
mirror
misbehave
miscellaneous
mischief
misconduct
miserable
misery
misfortune
mishap
mislead
miss
missile
missing
mission
missionary
mist
mistake
mistress
misunderstand
misunderstanding
mix
mixture
moan
mob
mobile
mock
model
modem
moderate
modernization
modernize
modest
modesty
moist
moisture
molecule
mom
moment
momentary
momentum
Monday
monetary
money
monitor
monitor
monk
monkey
monopoly
monotony
monster
monstrous
month
monthly
monument
mood
moon
mop
moral
morale
more
moreover
morning
mortal
mortar
mosquito
most
mostly
motel
mother
motherhood
motif
motion
motivate
motivation
motor
motorcycle
motto
mountain
mountainous
mourn
mouse
mouth
movable
move
movie
Mrs
much
mud
muddy
multiple
murder
murderer
murmur
muscle
muscular
muse
museum
mushroom
music
musical
musician
mustache
mustard
mute
mutton
mutual
mysterious
mystery
mythology
nag
nail
naive
naked
name
nap
napkin
narrate
narrative
narrow
nation
national
nationality
native
natural
naturally
nature
naughty
navy
nearby
nearly
nearsighted
neat
necessary
necessity
neck
necklace
necktie
need
needle
needy
negative
neglect
negligible
negotiable
negotiate
neighbor
neighborhood
neither
nephew
nerve
nervous
nest
net
never
nevertheless
new
newcomer
newlywed
news
newscaster
newspaper
nice
nickel
nickname
niece
night
nightingale
nightmare
nine
nineteen
ninety
nitrogen
nobility
noble
pron
clock
nJadv
nod
noise
noisy
nominal
nominate
nomination
nominee
none
nonetheless
nonsense
noodle
noodle
noon
nor
normal
north
northern
nose
notable
notably
note
noteworthy
notice
noticeable
notify
notorious
noun
nourish
novel
novel
novelist
novelty
November
now
nowadays
nuclear
nucleus
nude
nuisance
number
numerical
numerous
nun
nurse
nursery
nurture
nut
nutrition
oak
oasis
oath
obedient
obey
obituary
object
object
objection
objective
oblong
obscure
observant
observation
observatory
observe
obsession
obstacle
obtain
obvious
obviously
occasion
occasional
occupation
occupy
occur
ocean
October
odd
odds
offend
offense
offensive
offer
office
officer
official
offspring
often
pron
ad
ad
ad
date
of
oil
ointment
old
omen
ominous
once
one
onset
operational
opponent
oppress
optical
optimism
optimistic
option
optional
ordering
ordinance
ordinarily
organization
organize
orient
oriental
origin
original
originality
ornament
orphan
orphanage
orthodox
other
otherwise
oust
out
out
outbreak
outcome
outdoor
outdoors
outfit
outing
outlaw
outlet
outline
outnumber
outrage
outrageous
outset
outside
outskirts
outstanding
outward
oven
over
overcoat
overcome
overdo
overeat
overhear
overlap
overlook
overnight
overseas
overtake
overthrow
overturn
overwhelm
overwork
owe
owl
own
owner
ownership
ox
oxidation
oxygen
oyster
pace
pack
package
pact
page
pain
painful
painfully
paint
painter
painting
prop
pair
pajamas
pal
palace
pale
palm
pan
panacea
pancake
panda
pane
panel
panic
panorama
pants
papa
papaya
paper
parachute
parade
paradise
paradoxically
paragon
paragraph
paralyze
paramount
pardon
parent
park
park
parking
parlor
parrot
part
part
partial
partially
participant
participate
particular
partner
partnership
party
pass
passage
passenger
passerby
passion
passionate
passive
passport
past
past
paste
pasture
pat
path
pathetic
patience
patient
patient
patiently
patriot
patriotic
patron
pattern
pause
pave
pavement
paw
pawn
pawnshop
pay
payday
pea
peace
peaceful
peach
peak
peanut
pear
pearl
peasant
peculiar
pedal
pedestrian
peel
peep
peer
pen
time
penalty
pencil
penetrate
penetrating
penguin
penicillin
penis
penny
pension
pentagon
people
pepper
per
percent
percentage
perch
perfect
perfection
perform
performance
performer
perfume
perhaps
peril
period
periodic
periodical
perish
permanent
permission
permit
perpetual
perplex
perseverance
persist
persistent
person
personal
personality
perspective
persuade
persuasion
persuasive
pertain
pessimism
pest
pesticide
pet
petition
petroleum
petty
pharmacy
phenomenon
philharmonic
philosopher
philosophical
philosophy
phone
photo
photograph
photographer
photographic
photography
phrase
physical
physicist
physics
physiological
pianist
piano
pick
pick
picket
picnic
picture
picturesque
pie
piece
piety
pig
pigeon
pigment
pile
pilgrim
pilgrimage
pill
pillar
pillow
pilot
pimple
pine
up
pineapple
ping
pink
pint
pioneer
pious
pipe
pipeline
pirate
piston
pit
pitch
pitcher
pity
pizza
place
plague
plain
plainly
plan
plane
planet
planetary
planning
plant
plantation
plaster
plastic
plate
platform
Plato
play
playground
playmate
playwright
plea
pleasant
please
pleased
pleasure
pledge
plentiful
plenty
plot
plow
plug
plumber
plus
pneumonia
pocket
poem
poet
poetry
point
poison
poisonous
pole
police
policeman
policy
Polish
polish
polite
political
politician
politics
poll
pollutant
pollute
pollution
polynomial
pond
ponder
pong
pony
pool
poor
pop
popcorn
popular
popularity
populate
population
pork
port
portable
porter
portfolio
portion
portrait
portray
pose
position
positive
possess
possibility
possible
post
post
post
postage
poster
postman
postpone
posture
pot
potato
potent
potential
potentiality
potter
pottery
poultry
pound
pound
pour
poverty
powder
power
powerful
practical
practice
practitioner
praise
praiseworthy
pray
prayer
preacher
precaution
precedent
precious
precise
predecessor
predicament
predict
prediction
preface
prefer
preferable
preferably
preference
pregnant
prejudice
preliminary
premature
premier
premise
premium
preoccupation
preoccupy
preparation
prepare
prescribe
prescription
presence
present
present
present
presentation
presently
preservation
preserve
preside
presidency
president
presidential
press
press
pressure
presumption
pretend
pretty
pretty
prevent
preventive
preview
previous
price
pride
primary
prime
war
primitive
prince
princess
principal
principal
principally
principle
print
printer
priority
prison
privacy
private
privately
privilege
prize
probable
probe
problem
procedure
proceed
proceeding
process
processing
proclamation
produce
product
production
productive
productivity
profess
profession
professional
professor
proficient
profile
profit
profitable
program
progress
progressive
prohibit
prohibition
project
project
projection
prominent
promise
promising
promote
promotion
prompt
prone
pronoun
pronounce
proof
proper
property
prophesy
proposal
propose
prose
prosecute
prosecution
prospect
prosper
prosperity
prosperous
prostitute
protect
protective
protein
protest
proud
proudly
prove
proverb
provide
provincial
provoke
prudent
prune
psalm
psychiatrist
psychiatry
psychological
psychologist
psychology
pub
public
publication
publicity
publish
publisher
pull
pulmonary
pulse
pump
pumpkin
punctual
punctuation
punish
pupil
PUPPY
purchase
pure
purely
purity
purple
purpose
purse
pursue
pursuit
push
put
puzzle
pyjamas
quaint
quake
qualify
quality
quantity
quarrel
quarrelsome
quarter
queen
queer
quest
question
questionnaire
queue
quick
quiet
quit
quite
quiz
quotation
quote
rabbit
race
racial
rack
radar
radiate
radio
rag
rage
raid
railroad
railway
rain
rainbow
raincoat
rainfall
rainy
raise
rally
rancher
range
rank
ransom
rape
rapid
rare
rat
rate
rather
ratify
rational
raw
ray
razor
reach
react
reaction
reactionary
read
readiness
ready
real
realistic
reality
realize
reason
reasonable
reassure
rebel
rebel
rebellion
rebellious
rebuild
recall
recapture
receipt
receive
receiver
recent
reception
recession
recipient
reckless
reckon
recognition
recognize
recollect
reconcile
reconstruction
record
record
recorder
recover
recovery
recruit
recycle
red
reduce
redundant
reel
refer
reference
referendum
refine
refinement
reflect
reflection
reform
refrain
refresh
refreshment
refrigerator
refugee
refund
refusal
refuse
regain
regard
regarding
regiment
region
regional
register
registration
regret
regular
regulate
regulation
rehabilitate
rehabilitation
rehearsal
rehearse
reign
rein
reject
rejoice
relate
relationship
relative
relative
relatively
relax
release
reliable
relief
relieve
religion
religious
relinquish
relish
reluctant
reluctantly
rely
remain
remains
remark
remarkable
remedy
remember
remind
reminiscence
reminiscent
remote
remove
renaissance
renew
renowned
rent
reorganization
repair
repay
repeat
repel
repent
repetition
replaceable
replacement
reply
report
reporter
represent
representation
representative
repress
republic
republican
reputation
request
require
rescue
research
researcher
resemblance
resemble
resent
reservation
reserve
reservoir
reside
resign
resignation
resist
resistance
resolution
resolve
resonance
resort
resort
resource
respect
respectable
respectful
respective
respond
response
responsibility
responsible
rest
restaurant
restoration
restore
restraint
restrict
restroom
result
resultant
resume
retail
retaliate
retirement
retort
retreat
retrieve
return
reunion
reveal
revenge
reverse
review
revise
revision
revive
revolution
revolutionary
revolve
reward
rhetoric
rhythm
rhythmic
rib
ribbon
rice
rich
rid
riddle
ride
ridiculous
right
righteous
rigorous
ring
riot
ripe
rise
risk
rite
ritual
rival
river
roach
road
roar
roast
rob
robe
robin
robot
rock
rocket
role
roll
romance
romantic
roof
room
rooster
root
rope
rose
rot
rotate
rotation
rotten
rough
roughly
round
route
routine
row
royal
royalty
rub
rubber
rude
rug
rugged
ruin
rule
ruler
rumor
run
runner
rush
rust
rusty
sack
sad
saddle
safe
safety
sail
sailor
sake
salad
salary
sale
ad
pron
pron
salesman
saloon
salt
salute
salvage
salvation
same
sample
sanction
sand
sandal
sandwich
sanitation
sarcastic
Satan
satellite
satire
satisfaction
satisfactorily
satisfactory
satisfy
Saturday
sauce
sausage
savage
save
saving
saw
say
scale
scan
scandal
scare
scared
scarf
scarlet
scary
scatter
scene
scenery
schedule
scholar
scholastic
school
science
scientific
scientist
scissor
scold
score
scorn
scout
scrap
scrape
scratch
scream
screen
script
scrutiny
sculpture
sea
seal
seal
seam
search
season
seat
Second
secondary
secret
secretary
section
secular
secure
security
seduce
seek
seem
seemingly
segregate
seize
seldom
select
selection
self
selfish
sell
semester
seminar
send
aux
pl
sensation
sense
sensibility
sensible
sensitive
sentence
sentimental
separate
separately
separation
September
sequential
serious
sermon
serum
servant
serve
service
set
settle
settler
seven
seventeen
seventy
sever
several
severe
severely
sew
sewer
sex
sexual
shade
shadow
shady
shaft
shake
shallow
shame
shameful
shampoo
shape
share
sharp
shave
shear
shed
sheep
sheep
sheer
shelf
shell
shelter
shepherd
shepherd
shift
shine
shiny
ship
shipment
shirt
shiver
shock
shocked
shocking
shoe
shoot
shop
shop
shore
short
shortage
shortcoming
shorten
shorts
shortsighted
shot
should
shoulder
shout
show
shower
shrimp
shrink
shut
shy
sibling
sick
side
sidewalk
sigh
sight
sightseeing
sign
signal
signature
significance
significant
silence
silent
silently
silk
silly
silver
similar
similarity
similarly
simple
simplicity
simplify
simultaneously
sin
since
sincere
sincerity
sing
singer
single
singular
sinister
sink
sink
sir
sister
sit
site
sitter
situate
situated
situation
six
sixteen
sixty
sizable
size
skate
skeleton
sketch
skill
skillful
skin
skinny
skip
skirt
sky
slam
slap
slash
slave
sleep
sleepy
sleeve
slender
slice
slide
slight
slim
slip
slipper
slippery
slogan
slope
sloppy
slow
slug
slum
small
smallpox
smart
smell
smile
smog
smoke
smooth
smuggle
snack
snail
snake
snap
snatch
pron
pron
pron
sneak
sneaker
sneeze
snow
snowy
so
soak
soap
sob
sober
soccer
social
socialism
socially
society
sociological
sociology
sock
soda
sodium
sofa
soil
solar
soldier
sole
solely
solicitor
solid
solidarity
solitary
solitude
solo
solve
some
somebody
someday
somehow
someone
something
sometime
sometimes
somewhat
somewhere
son
song
soon
sore
sorrow
sorry
sort
soul
sound
sound
soup
sour
source
south
southern
souvenir
sovereign
sovereignty
sow
space
spade
spaghetti
spare
sparkle
sparrow
speak
speaker
special
species
specific
spectacles
spectacular
spectra
speculate
speech
speed
spell
spelling
spend
sperm
spice
spider
spill
spinach
spirit
spiritual
spit
spite
splash
splendid
split
spoil
sponsor
spontaneous
spoon
sport
sportsman
spot
spouse
sprawl
spray
spread
spring
spring
spur
spy
squad
square
squarely
squeeze
squirrel
stab
stability
stable
stack
stadium
stage
stagger
stair
stale
stall
stamp
stand
standard
standardize
standpoint
staple
star
stare
start
startle
starve
state
state
statesman
static
station
stationary
stationery
statistical
statue
stature
status
statute
stay
steady
steak
steal
steam
steel
steep
steer
step
stepchild
stereo
stereotype
steward
stick
sticky
stiff
still
stimulation
stimulus
sting
stingy
stir
stocking
stomach
stone
stool
stoop
stop
storage
store
storm
stormy
story
ad
prop
stove
straight
straighten
strain
strange
stranger
strategic
strategy
straw
strawberry
streak
stream
street
streetcar
strength
strengthen
stress
stretch
strict
stride
strike
string
strive
stroke
stroke
strong
structural
structure
struggle
stu
stubborn
student
studio
study
stuff
stuff
stupid
sturdy
style
subdue
subject
subjective
submarine
submit
subscribe
subsequently
subsidy
substance
substantially
subtract
suburb
succeed
success
successful
successive
such
suck
suckle
sudden
suffer
suffering
sufficient
suffocate
sugar
sugarcane
suggest
suggestion
suicide
suit
suit
suitable
suitcase
sum
summarize
summary
summer
summit
summon
sun
Sunday
sunlight
sunny
sunset
sunshine
super
superb
superficial
superfluous
superhighway
superimpose
adi
superintendent
superior
superiority
supermarket
superstition
superstitious
supervise
supervisor
supper
supplement
supply
support
suppose
supposedly
suppress
sure
surface
surface
surge
surgeon
surgery
surname
surprise
surprised
surprising
surrender
surround
surroundings
survey
survival
survive
survivor
suspension
suspicion
suspicious
swallow
swallow
swan
sway
swear
sweat
sweater
sweep
sweet
sweet
swift
swim
swing
switch
sword
syllable
syllabus
symbol
symmetry
sympathetic
sympathize
sympathy
symphony
synonym
synthesis
system
systematic
systematically
table
tablespoon
tablet
tabloid
taboo
tackle
tag
tail
tailor
take
tale
talent
talkative
tall
tally
tame
tan
tangerine
tangible
tank
tanker
tap
tape
target
tariff
pron
pron
task
taste
tasty
tax
taxi
tea
teach
teacher
team
tear
tear
tease
technical
technician
technique
technological
technology
teenager
telegram
telegraph
telephone
telescope
television
tell
teller
temper
temperament
temperature
tempest
temple
temporary
tempt
temptation
ten
tenant
tend
tendency
tender
tennis
tense
tension
tent
tentative
terminal
terminate
tern
terrace
terrible
terrific
terrified
terrify
territory
test
testify
text
textbook
than
thank
thankful
theater
theatrical
theft
theme
then
theologian
theological
theoretical
theory
therapeutic
therapist
there
therefore
thermal
these
thesis
thick
thief
thigh
thin
thing
think
third
thirst
thirsty
thirteen
thirty
thorough
those
though
thought
nJv
thoughtful
thousand
thread
threat
threaten
three
threshold
thrift
thrill
thrilling
thrive
throat
through
throughout
throw
thumb
thunder
thunderstorm
Thursday
thus
thyroid
ticket
tide
tidy
tie
tie
tiger
tight
tighten
tightly
till
timber
time
timid
tiny
tip
tire
tire
tired
tiresome
tissue
title
toast
tobacco
today
toe
tofu
together
toilet
token
tolerate
toll
tomato
tomb
tomorrow
ton
tone
tongue
tonight
tool
tooth
toothbrush
toothpaste
top
topic
tortoise
torture
toss
total
totally
touch
touchstone
tough
tour
tourism
tourist
tournament
tow
toward
towel
tower
town
toxic
toy
trace
track
tractor
trade
tradition
traditional
traffic
tragedy
tragic
train
train
tranquil
tranquilizer
transcend
transfer
transformation
transit
transition
translate
translation
translator
transmission
transmit
transplant
transport
trauma
travel
traveler
traverse
tray
treasure
treat
tree
tremble
tremendous
trend
trespass
trial
triangle
tribe
tribune
trick
tricky
trigger
trim
trip
triumph
triumphant
trivial
troop
trophy
tropical
trouble
troublesome
trousers
truck
true
trumpet
trunk
trust
truth
try
tsunami
tub
tube
tuberculosis
Tuesday
tuition
tumble
tumor
tumpike
tune
tunnel
turkey
turmoil
turn
turtle
tutor
twelve
twenty
twice
twig
twin
twinkle
twist
two
type
type
typewriter
typhoon
typical
typist
tyrant
pron
prop
ugly
ulcer
ultimately
ultraviolet
umbrella
unanimously
unaware
uncle
uncomfortable
unconsciously
under
underdeveloped
underestimate
undergo
undergraduate
underground
underline
understandable
undertake
underwear
underwrite
undesirable
undue
unemployed
unemployment
unexpectedly
unfair
unforgettable
unfortunate
ungrateful
uniform
unify
union
unit
unite
unity
universe
university
unless
unlike
unlimited
unload
unlock
unofficial
unpleasant
unprecedented
unpredictable
unrest
until
untouched
unusually
up
upbringing
upend
upgrade
uplift
upper
uproot
upset
upstairs
uranium
urban
urge
urgency
urgent
us
usage
use
used
useful
usefulness
useless
usher
usual
utensil
utmost
Utopia
utterly
vacancy
vacant
vacation
vaccine
vacuum
vaguely
vain
validity
valley
valuable
value
vanilla
vanish
vanity
vapor
variable
variation
variety
various
vary
vase
vast
vegetable
vegetarian
vehicle
veil
vent
venture
Venus
verb
verbal
verdict
verify
versatile
verse
vertical
very
vet
vex
via
viable
vibration
vicious
victim
victimize
victory
video
view
vigor
vigorously
vigour
villa
village
villain
vine
vinegar
vineyard
violate
violence
violent
violet
violin
virtually
virtuous
virus
visa
visible
vision
visit
visitor
visual
visualize
vital
vitamin
vivid
vocabulary
vocal
vocation
vogue
voice
volcano
volleyball
volume
voluntary
volunteer
vomit
vote
voter
vow
vowel
voyage
vulgar
vulnerable
wagon
waist
wait
waiter
advJpron
pron
pron
pron
pron
pron
pron
pron
pron
pron
pron
waitress
wake
waken
walk
Walkman
wall
wallet
walnut
wander
want
warn
warning
warrant
warrior
warship
wash
waste
watch
watch
water
waterfall
watermelon
wave
wax
way
wayside
weak
weaken
wealth
wealthy
weapon
wear
weary
weather
weave
web
wedding
Wednesday
weed
week
weekday
weekend
weekly
weep
weigh
weight
welcome
welfare
well
well
West
western
wet
whale
what
whatever
whatsoever
wheat
wheel
wheelchair
when
whenever
where
whereabouts
whereby
wherever
whether
which
whichever
while
whisper
whistle
white
who
whoever
whole
wholesale
wholly
whom
whose
why
wicked
wide
widen
widower
width
wife
wild
wilderness
wildly
will
will
willing
willingness
win
wind
wind
window
windy
wine
wing
winner
winter
wipe
wire
wisdom
wise
wish
witch
with
withhold
within
without
withstand
witness
woe
wolf
wolf
woman
wonder
wonderful
wood
wool
word
work
worker
world
worm
worried
worry
worse
worship
worth
worthy
wound
wrap
wreckage
wrist
write
writer
writing
wrong
yacht
Yale
yard
yawn
yeah
year
yearly
yearn
yeast
yell
yellow
yesterday
yet
yield
youngster
youth
youthful
zeal
zealously
zebra
zero
zip
zone
zoo
zoology